# Energy Analysis Zone Air Changes Per Hour Property

Source: https://www.revitapidocs.com/2026/722422b3-8a8c-6683-a9a0-a24369a77e60.htm

---

| Energy Analysis Zone Air Changes Per Hour Property |
| --- |

The outside air rate or air changes per hour as a number between 0 and 10000\.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double AirChangesPerHour { get; }
```

```
Public ReadOnly Property AirChangesPerHour As Double
	Get
```

```
public:
property double AirChangesPerHour {
	double get ();
}
```

```
member AirChangesPerHour : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace